# -*- coding: utf-8 -*-
#tbl_human_comment.py

#辞書ファイルかリストかタプルとして書いておく
#csvやtxtで書いてあるのを読み込むのが難しそうだから
#行によって、要素数が異なることに対応しないといけない
#検索方法を考えないといけない
#もしかしたら、検索時間も考慮しないといけない
#JSONとかでできる？

#ここに書かれている、全要素、例えば、（こんにちは、コンニチワ）、（いい、よい、良い）、など全てを１行ずつ、
#認識結果（例えば、「こんにちは、いい天気だなー」）に対して検索していく必要がある。
#この場合は、"こんにちは"と、"いい"が検索で見つかるべきで、
#その見出しの、"konnichiha"と、"ii"が検索結果となるべき。

#0,konnichiha,こんにちは,コンニチワ
#1,tsukareta,疲れた,ツカレタ
#2,yoi,いい,よい,良い

dict_human_term = {
    "こんにちは":("こんにちは","こんちは","はろー","ハロー",),
    "おはよう":("おはよう",),
    "お疲れ様":("お疲れ様",),
    "さようなら":("さようなら","さよなら","バイバイ","バイバーイ","ばいばい","グッバイ",),
    "疲れた":("疲れた","つかれた",),
    "良い":("いい","よい","良い",),
    "私は":("私は","わたしは","僕は","あたしは","おれは","俺は","オレは",),
    "と言います":("と言います","といいます","と申します","です","って言います","っていいます"),
    "年齢":("年齢","とし","年",),
    "当て":("当て",),
    "今日":("今日","本日",),
    "天気":("天気",),

    "おはよう":("おはよう","おはようございます","グッドモーニング",),
    "はじめまして":("はじめまして","おはつ","おはつです",),
    "かわいいですね":("かわいいですね","かわいい","かわいいね",),
    "いくつに見える":("いくつにみえ","いくつに見え","いくつだと思","いくつだとおも","いくつだか分","いくつだかわ",),
    "元気":("元気","げんき","調子","ちょうし",),
    "本当に":("ほんとうに","本当に","ほんとに","ほんと","まじ","まじで","マジ","マジで","ほんまに","ほんまか","ほんま",),
    "冗談":("冗談","じょうだん","じょーだん","ジョーダン","うそ","うそー","嘘",),
    "すごい":("すごい","すごいね","すごーい","すげー","スゲー",),
    "さむい":("さむい","寒い","さむいね","寒いね","さむくない","寒くない","さみー","さみーね",),
    "ありがとう":("ありがとう","ありがとー","さんきゅー","サンキュー","ありがとね","ありがとーね",),
    "自己紹介":("じこしょうかい","じこしょーかい","自己紹介","ジコショーカイ","ジコショウカイ",),
    "あなた":("あなた","きみ","君","おまえ","そなた","おぬし",),
    "だれ":("だれ","誰"),
    "人間":("人間","にんげん","ニンゲン","人","ひと","ヒト",),
    "褒めて":("褒めて","誉めて","ほめて","ホメテ",),
    "もっと":("もっと","モット",),
    "素敵":("素敵","すてき",),
    "かっこいい":("かっこいい","かっこ良い",),
    "上手":("上手","じょうず","じょーず","ジョーズ","うまい","上手い","ウマイ",),
    "空腹":("空腹","くうふく","お腹すいた","おなかすいた","腹減った","はらへった","腹減り","はらへり",),
    "人が多い":("人が多い","ひとがおおい","混んでる","こんでる","混雑","こんざつ","人ごみ","人ゴミ","ひとごみ",),

    "おもしろそうだね":("おもしろそうだね","おもしろそう","おもろい","たのしそう","たのしい",),
    "うれしいね":("うれしいね","うれしい","さすがだね","じょうずだね","じょうず","いうね",),
    "おしまい":("おしまい","おわり","これだけ","こんなもの",),
    "頑張って":("頑張って","がんばって",),
    "いいね":("いいね","いいよ","すごい","すごいよ",),

    "近い":("近い","近所","遠くない","遠くじゃない",),
    "遠い":("遠い","遠方","近くない","近くじゃない",),

    "秘密":("秘密","内緒","言えない",),
}
